Revit 2026 API

# ElectricalSystemLength Property

---

The Length value of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Length { get; }
```
```vb
Public ReadOnly Property Length As Double
	Get
```
```cpp
public:
property double Length {
	double get ();
}
```
```fsharp
member Length : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the length cannot be computed, because it is zero, or because the circuit is not connected to a panel. |

This property is used to retrieve the Length value of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace